1795. Rearrange Products Table

Table: Products

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| product_id  | int     |
| store1      | int     |
| store2      | int     |
| store3      | int     |
+-------------+---------+
product_id is the primary key (column with unique values) for this table.
Each row in this table indicates the product's price in 3 different stores: store1, store2, and store3.
If the product is not available in a store, the price will be null in that store's column.
 

Write a solution to rearrange the Products table so that each row has (product_id, store, price). If a product is not available in a store, do not include a row with that product_id and store combination in the result table.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Products table:
+------------+--------+--------+--------+
| product_id | store1 | store2 | store3 |
+------------+--------+--------+--------+
| 0          | 95     | 100    | 105    |
| 1          | 70     | null   | 80     |
+------------+--------+--------+--------+
Output: 
+------------+--------+-------+
| product_id | store  | price |
+------------+--------+-------+
| 0          | store1 | 95    |
| 0          | store2 | 100   |
| 0          | store3 | 105   |
| 1          | store1 | 70    |
| 1          | store3 | 80    |
+------------+--------+-------+
Explanation: 
Product 0 is available in all three stores with prices 95, 100, and 105 respectively.
Product 1 is available in store1 with price 70 and store3 with price 80. The product is not available in store2.

In [34]:
import pandas as pd

data = {"product_id":[0,1],"store1":[95,70],"store2":[100,None],"store3":[105,80]}

Products = pd.DataFrame(data)

Products

   product_id  store1  store2  store3
0           0      95   100.0     105
1           1      70     NaN      80

In [39]:
output_df = pd.DataFrame(columns=["product_id","store","price"])

In [40]:
for i in range(Products.shape[0]):
    j=0
    while(j<Products.shape[1]-1):
        dictionary = {"product_id":int(Products.iloc[i][0]),"store":f"store{j+1}","price":Products.iloc[i][j+1]}
        # first entry is product id followed by prices for 3 stores, started with j=0
        output_df= output_df._append(dictionary,ignore_index=True)
        j=j+1

In [41]:
output_df

   product_id   store  price
0         0.0  store1   95.0
1         0.0  store2  100.0
2         0.0  store3  105.0
3         1.0  store1   70.0
4         1.0  store2    NaN
5         1.0  store3   80.0

In [44]:
# remove nan

output_df = output_df.dropna()

print(output_df)

   product_id   store  price
0         0.0  store1   95.0
1         0.0  store2  100.0
2         0.0  store3  105.0
3         1.0  store1   70.0
5         1.0  store3   80.0

#### SQL Solution

create table products(product_id int, store1 int, store2 int, store3 int);

insert into products values (0,95,100,105);
insert into products values (1,70,null,80);

select * from products;

select * from
(SELECT product_id, 'store1' AS store, store1 AS price FROM products
UNION ALL
SELECT product_id, 'store2' AS store, store2 AS price FROM products
UNION ALL
SELECT product_id, 'store3' AS store, store3 AS Price FROM products) tmp
where price is not null;